[
  {
    "title": "Tailoring Adversarial Attacks on Deep Neural Networks for Targeted Class Manipulation Using DeepFool Algorithm",
    "date": "2023",
    "authors": "S. M. Fazle Rabby Labib, Joyanta Jyoti Mondal, Meem Arafat Manab, Sarfaraz Newaz, Xi Xiao",
    "abstract": "The susceptibility of deep neural networks (DNNs) to adversarial attacks undermines their reliability across numerous applications, underscoring the necessity for an in-depth exploration of these vulnerabilities and the formulation of robust defense strategies. The DeepFool algorithm by Moosavi-Dezfooli et al. (2016) represents a pivotal step in identifying minimal perturbations required to induce misclassification of input images. Nonetheless, its generic methodology falls short in scenarios necessitating targeted interventions. Additionally, previous research studies have predominantly concentrated on the success rate of attacks without adequately addressing the consequential distortion of images, the maintenance of image quality, or the confidence threshold required for misclassification. To bridge these gaps, we introduce the Enhanced Targeted DeepFool (ET DeepFool) algorithm, an evolution of DeepFool that not only facilitates the specification of desired misclassification targets but also incorporates a configurable minimum confidence score. Our empirical investigations demonstrate the superiority of this refined approach in maintaining the integrity of images and minimizing perturbations across a variety of DNN architectures. Unlike previous iterations, such as the Targeted DeepFool by Gajjar et al. (2022), our method grants unparalleled control over the perturbation process, enabling precise manipulation of model responses. Preliminary outcomes reveal that certain models, including AlexNet and the advanced Vision Transformer, display commendable robustness to such manipulations. This discovery of varying levels of model robustness, as unveiled through our confidence level adjustments, could have far-reaching implications for the field of image recognition. Our code will be made public upon acceptance of the paper."
  },
  {
    "title": "Unveiling the Cultural and Health Dynamics of Online Food Ordering: A Machine Learning Approach to Consumer Behavior and Obesity Correlation",
    "date": "2023",
    "authors": "S. M. Fazle Rabby Labib, Fahmida Zaman Achol, Md. Aqib Jawwad, Md. Golam Rabiul Alam, Md Iftekharul Mobin, Senthil Kumar Jagatheesaperumal, Bader Fahad Alkhamees, Mohammad Mehedi Hassan",
    "abstract": "With online food ordering (OFO) becoming a ubiquitous part of modern consumer behavior, understanding its determinants and potential health impacts has global relevance. This study explores the key drivers of OFO usage, order frequency, and possible links to obesity, using Bangladesh as a specific data case to provide localized insights applicable to broader trends. Employing machine learning and various statistical methods, this research identifies key factors shaping OFO behavior that transcend cultural boundaries, including impulsive decision-making, convenience, variety, and the appeal of promotional offers. Survey data from 343 participants aged 16 - 30 provide a basis for analysis, revealing a weak positive association between OFO frequency and obesity (p-value = 2.43e-7, coefficient = 0.28). Classification models, particularly Random Forest, demonstrated robustness in predicting frequent OFO users, achieving 81% accuracy. Customer segmentation highlights that while infrequent users cite cost concerns, frequent users are more mindful of the nutritional quality of their orders. Hypothesis testing also suggests a correlation between tech-savvy and positive perceptions of OFO services' usability. Globally, the findings indicate that individuals with busy lifestyles are more inclined toward impulsive ordering decisions, influenced by the affordability and promotional discounts OFO services provide. This study contributes to the global understanding of digital consumer behavior and health implications, providing a nuanced perspective on the cultural and economic dimensions that shape OFO practices worldwide"
  }
]

